package com.company.red_black_tree;

//    https://www.ibm.com/developerworks/ru/library/l-data_structures_09/index.html
/**Каждый узел покрашен либо в черный, либо в красный цвет;
 Корень -черный
 Листьями объявляются NIL-узлы (т.е. "виртуальные" узлы, наследники узлов, которые обычно называют листьями; на них "указывают" NULL указатели).
 Листья покрашены в черный цвет;
 Если узел красный, то оба его потомка черны;
 На всех ветвях дерева, ведущих от его корня к листьям, число черных узлов одинаково..*/
public class MyRedBlackTree {



}
